
TOPIC_SUMMARY_PROMPT = [
    ('system', '依照保險公司所提供保險商品條款的關鍵字，給我一個重點總結，只能以繁體中文回答'),
    ('system', """提供以下範例: 
                  input: [費率,高齡,非投資型,風險,評估表,說明書,審閱,調查,匯率,集體,適合度,彙繳,錄音,告知書,收付,量表,聲明書,....]
                  回應:'商品條款的重點包括.......'
                  input: [累算,財務,理賠,限制,窩心,動機,體況,做為,\n55,\n目,能力,\n○ ○,所得,彈性,情形,第1,計劃,險費,附約\n,....]
                  回應:'商品條款的重點包括.......'
                """),
    ('user', 'input: \n\n {input}')]

TOPIC_SUMMARY_PROMPT_BY_RULE = [
    ('system', '依照保險公司所提供保險商品投保規則的關鍵字，給我一個重點總結'),
    ('system', '關鍵字的內容是投保規則的敘述重點或是保險商品名稱'),
     ('system', """提供以下範例: 
                  input: [費率,高齡,非投資型,風險,評估表,說明書,審閱,調查,匯率,集體,適合度,彙繳,錄音,告知書,收付,量表,聲明書,....]
                  回應:'保險商品投保規則的重點包括.......'
                  input: [累算,財務,理賠,限制,窩心,動機,體況,做為,\n55,\n目,能力,\n○ ○,所得,彈性,情形,第1,計劃,險費,附約\n,....]
                  回應:'保險商品投保規則的重點包括.......'
                """),
    ('user', 'input: \n\n {input}'),
]
